# PrimarySizeCriterion Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PrimarySizeCriterion Members
PrimarySizeCriterion Class Constructors Methods Properties See Also
---
The PrimarySizeCriterion type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| PrimarySizeCriterion | Constructs a PrimarySizeCriterion with a minimum and maximum size. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| All | Creates a criterion with a range of all sizes. |
| Dispose | (Inherited from RoutingCriterionBase.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsEqual | Verify if two criteria are the same.  (Inherited from RoutingCriterionBase.) |
| None | Creates a criterion with a range of no sizes. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RoutingCriterionBase.) |
| MaximumSize | The maximum size of this criterion. |
| MinimumSize | The minimum size of this criterion. |

# See Also
PrimarySizeCriterion Class
Autodesk.Revit.DB Namespace